package javaPracticeHonma;

/*
 * 目的：基本勉強（動くプログラム）レベル5 ミュージックプレイヤー
 * 内容：継承とインターフェース
 *     (https://qiita.com/s_hino/items/85ce20cb675484d300f0)
 * 作成者：本間夏海
 */

import java.util.ArrayList;
import java.util.List;

public class JavaPractice_7 {
	
	public static void main(String[] args) {
		
		// ウォークマン(walkman)とiPod(iPod)の２種類の音楽プレイヤーを作成してください。
		// どちらにも再生・一時停止・停止の機能が備わっています。
		// 任意の曲名とアーティスト名を入れられるようにしてください。
		// 操作はmainメソッドを使用して行ってください。
		
		// ■使用開始メッセージの例
		// iPodの使用を開始します。
		
		// ■曲名・アーティストのメッセージの例
		// いきものがかり の ブルーバード を再生します。
		
		// また、ウォークマンとiPodの機能特徴は以下の通りですので個別のメソッドで実装してください。
		
		// ■ウォークマン
		// 再生：「爆音で再生します」
		// 一時停止：「3分間待ってやる」
		// 停止：「停止しました」
		
		// ■iPod
		// 再生：「ひかえめに再生します」
		// 一時停止：「かしこまりました、一時停止します」
		// 停止：「再生を停止しました」
		
		
		
		
	}
}
